sprout88/msp430_project/프로젝트_2번/main.c
#include <msp430.h>
#define ADC_DELTA_TEN_TIME 1507
#define ADC_MIN 1081
#define ADC_MAX 4095

unsigned int tmp1 = 0;
unsigned int tmp2 = 0;

unsigned int digits[10] = { 0xdb, 0x50, 0x1f, 0x5d, 0xd4, 0xcd, 0xcf, 0xd8, 0xdf, 0xdd}; // 7 segment digits
unsigned int special_digits[] = {
    0x00, /* 0 : 꺼짐 */
    0x20, // 0 : dot */
};
unsigned int screen_arr[4] = {0x00,0x00,0x00,0x00};
unsigned int adc_data = 3000;
unsigned int scaled_adc_data = 0;

/* project phase */
unsigned int proj_2_phase = 0;

/* timers */
unsigned int led_toggle_cnt = 0;
unsigned int motor_cnt_7 = 0; // 문제 2-3 에서 모터 7초 세기 카운터
char motor_cnt_7_lock = 0; // counter lock, enable(1) 일때만 카운트. lock(0)
unsigned int dynamic_segment_cnt = 0; // iterate 0~3
unsigned int smclk_cnt = 0; // iterate 0ms ~ 1000ms

/* cooldowns */
unsigned int motor_ms_cooldown = 0; // if not 0, -- to 0

/* switch locks */
unsigned int is_left_switch = 0;
unsigned int is_right_switch = 0;
unsigned int p2_1_switch_clicked_cnt = 0;

/* locks */
unsigned int toggle_lock = 0; // 0 : off, 1 : on
unsigned int screen_mode = 0; // 0: arr_mode, 1: decimal mode
unsigned int led_toggle_state = 0;
char p4_7_left_led_on = 0; // led and screen error fix

char keypad_pushed_lock_arr[12] = {0,}; // 1~9 + 0,*,# *=[11], #=[12]


/* function locks */
unsigned int toggle_led_per_time_ms_lock = 0;
char adc_single_read_to_segment_lock = 0; // locked:0 unlocked:1

/* states */
unsigned int g_anti_clockwise_pwm = 0;
unsigned int g_clockwise_pwm = 0;

/* motor locks */
unsigned int g_motor_clockwise_spin_start = 0;
unsigned int g_motor_anti_clockwise_spin_start = 0;
int g_total_pwm = 0;

int g_motor_signal = 0; // 0:(신호없음), 1:on명령, -1:off명령
int g_motor_spin_direction_signal = 0; // -1:anti-clockwise, 0:stop, 1:clock-wise

int g_motor_toggle = 0; // 0:off, 1:on

/* watchdog timer functions */
void stop_watchdog_timer(void);

/* switch functions */
void init_right_switch(void);
void init_left_switch(void);
void right_switch_interrupt_handler(void);
void left_switch_interrupt_handler(void);

/* led functions */
void init_led(int led_num);
void turn_on_led(int led_num);
void turn_off_led(int led_num);
void toggle_led_per_time_ms(unsigned int toggle_interval_ms);

/* 7 segment functions */
void init_7_segment(void);
void init_smclk(void);
void show_screen(unsigned int);
void show_screen_arr(void);

/* keypad functions */
void init_keypad(void);
void keypad_input_polling_checker_anticht_by_while(void);
void keypad_push_handler(unsigned int key);
void keypad_release_handler(unsigned int key);
void keypad_input_polling_checker_anticht_by_lock(char* p_pushed_lock_arr);

/* motor and encoder functions */
void init_motor(void);
void set_motor_spin_pwm(unsigned int* p_clockwise_pwm, unsigned int* p_anti_clockwise_pwm);
void motor_speed_controller_7(int clockwise, unsigned int* p_cnt_7, int* p_motor_signal); // set_motor_spin_pwm 과 같이 사용해야함
void keypad_push_motor_handler(char* p_keypad_push_lock_arr,unsigned int* p_clockwise_pwm,unsigned int* p_anti_clockwise_pwm);
void set_motor_spin_pwm_single(int* p_total_pwm, unsigned int* p_clockwise_pwm, unsigned int* p_anti_clockwise_pwm);

/* ADC functions */
void init_ADC_single_mode(void);
void init_ADC_repeat_single_mode(void);
void ADC_single_read(unsigned int* p_data); // read adc hardware and save to global_var:adc_data
void ADC_repeat_single_read(unsigned int* p_data);
void adc_data_scale_and_save_to_segment_arr(unsigned int* p_adc_data, unsigned int* p_screen_arr);
void adc_single_read_to_segment(void);

/* interrupt functions */
void enable_interrupt_vector(void);

/* custom functions for solve projects */
unsigned int scale_transform(int input);

////////////////////////////////////


// ### Original Functions Prototypes

// ### Main ###
void main(void) {
    stop_watchdog_timer();

    init_smclk();

    init_7_segment();
    init_right_switch();
    init_left_switch();
    init_ADC_single_mode();

    init_led(1);
    init_led(2);

    init_keypad();

    init_motor();

    enable_interrupt_vector();

    while(1){
        toggle_led_per_time_ms(scaled_adc_data*100); // only if toggle_lock = true, scaled_adc_data(0~20)
        show_screen_arr(); // show adc_data

        keypad_input_polling_checker_anticht_by_lock(keypad_pushed_lock_arr);

        set_motor_spin_pwm_single(&g_total_pwm, &g_clockwise_pwm, &g_anti_clockwise_pwm);

        if(proj_2_phase==3){ // 모터 증감속은 2-3 에서만 작동함
            keypad_push_motor_handler(keypad_pushed_lock_arr, &g_clockwise_pwm, &g_anti_clockwise_pwm); // set_motor_spin_pwm 과 함께 사용
        }
        
        adc_single_read_to_segment(); // 처음엔 locked, switch handler 에 의해 unlock

    }
}

// ### Original Function declare
/* Write Your Function Here */

// ### override functions

// right switch dir p2.1
void right_switch_interrupt_handler(void){
    proj_2_phase++; // 프로젝트 번호에 따라 스위치가 다른 동작을 함.
    switch(proj_2_phase){
        case 1: // 2-1 : ADC 값을 0~2 로 매핑 후 세그먼트 출력
            adc_single_read_to_segment_lock = 1; // unlock
            break;
        case 2: // 2-2 : ADC 값 만큼 LED 토글
            adc_single_read_to_segment_lock = 1; // lock previous actions
            toggle_led_per_time_ms_lock = 1; // unlock toggle_led_per_ms mode
            break;
        case 3: // 2-3 모터 증감속
            break;
        case 4: // 2-4 : 초음파 거리 측정, 물체 감지 시 정지
            break;

    }

    if(toggle_lock == 1){ // adc_scaled_sec 로 led를 이미 toggle 중이였다면 종료 후 모터 모드로 전환

    }

    toggle_lock = 1;

}


// left switch dir p1.1
void left_switch_interrupt_handler(void){
    // write your code here
    g_anti_clockwise_pwm = 500;
    g_clockwise_pwm = 0;
}

void keypad_push_handler(unsigned int key){ // 각 case 를 구현하지 않아도 오류 없음. (keypad_input_polling_checker에서 검증함)
    switch(key){
        case 0:
            tmp1=0;
            // input your handler
            break;
        case 1:
            tmp1=1;
            // input your handler
            break;
        case 2:
            tmp1=2;
            // input your handler
            break;
        case 3:
            tmp1=3;
            // input your handler
            break;
        case 4:
            tmp1=4;
            // input your handler
            break;
        case 5:
            tmp1=5;
            // input your handler
            break;
        case 6:
            tmp1=6;
            // input your handler
            break;
        case 7:
            tmp1=7;
            // input your handler
            break;
        case 8:
            tmp1=8;
            // input your handler
            break;
        case 9:
            tmp1=9;
            // input your handler
            break;
        case 10:
            tmp1=10;
            // input your handler
            break;
        case 11: // 11:star
            tmp1+=1;
            break;
        case 12: // 12:sharp
            tmp1=12;
            break;
    }
}
void keypad_release_handler(unsigned int key){ // 각 case 를 구현하지 않아도 오류 없음. (keypad_input_polling_checker에서 검증함)
    switch(key){
        case 0:
            tmp2=0;
            // input your handler
            break;
        case 1:
            tmp2=1;
            // input your handler
            break;
        case 2:
            tmp2=2;
            // input your handler
            break;
        case 3:
            tmp2=3;
            // input your handler
            break;
        case 4:
            tmp2=4;
            // input your handler
            break;
        case 5:
            tmp2=5;
            // input your handler
            break;
        case 6:
            tmp2=6;
            // input your handler
            break;
        case 7:
            tmp2=7;
            // input your handler
            break;
        case 8:
            tmp2=8;
            // input your handler
            break;
        case 9:
            tmp2=9;
            // input your handler
            break;
        case 10:
            tmp2=10;
            // input your handler
            break;
        case 11: // 11:star
            tmp2=11;
            break;
        case 12: // 12:sharp
            break;
    }
}
///////////////////////////////////////

//
// ### non-override functions
void adc_single_read_to_segment(){
    if(adc_single_read_to_segment_lock == 1){
        ADC_single_read(&adc_data); // read adc hardware and save to global_var:adc_data
        adc_data_scale_and_save_to_segment_arr(&adc_data,&screen_arr[0]); // convert adc_data to special scaled formet and save to segment_arr
    }
}
void adc_data_scale_and_save_to_segment_arr(unsigned int* p_adc_data, unsigned int* p_screen_arr){

    // 소수점 변환 수행
    scaled_adc_data = scale_transform(*p_adc_data);

