sprout88/msp430_project/프로젝트_2번/main.c
    // 자릿수 분리
    if(scaled_adc_data != 1111){
        unsigned int units = scaled_adc_data/10%10; // xxN.?xx
        unsigned int tenths_place_num = scaled_adc_data%10; // xxx.Nxx

        // edit global screen arr
        p_screen_arr[3] = special_digits[0]; // far left : off
        p_screen_arr[2] = special_digits[0]; // mid left : off
        p_screen_arr[1] = digits[units]+special_digits[1]; // mid right : units.
        p_screen_arr[0] = digits[tenths_place_num]; // far right
    }
}

void stop_watchdog_timer(void){
    WDTCTL = WDTPW | WDTHOLD; // stop watchdog timer
}

void init_left_switch(void){
    P1OUT |= BIT1; // DIR
    P1REN |= BIT1; // pull up resister

    P1IE |= BIT1; // Interrupt Enable
    P1IES |= BIT1; // Interrupt edge select : Falling Edge
    P1IFG &= ~BIT1; // interrupt flag
}

void init_right_switch(void){
    P2OUT |= BIT1; // DIR
    P2REN |= BIT1; // pull up resister

    P2IE |= BIT1; // Interrupt Enable
    P2IES |= BIT1; // Interrupt edge select : Falling Edge
    P2IFG &= ~BIT1; // interrupt flag
}

void init_7_segment(void){
    /* 7 segment Digital Output */
    P3DIR |= 0xffff;
    P3OUT &= 0x0000;
    P4DIR |= 0x000f;
    P4OUT = 0x0F; // segment : XXXX
}

void init_smclk(void){
    /* Timer - Timer0 */
    TA0CCTL0 = CCIE;
    TA0CCR0 = 1000; //1000;
    TA0CTL = TASSEL_2 + MC_1 + TACLR; // SMCLK : 1Mhz / Up mode to CCRO
    /* END Timer - Timer0 */
}

void show_screen(unsigned int value){
    if (dynamic_segment_cnt > 3)
        dynamic_segment_cnt = 0; // count 순회

    switch (dynamic_segment_cnt)
    {
    case 0:
        P3OUT = digits[value%10];
        if(p4_7_left_led_on) // segment : XXXO
            P4OUT = 0x8E;
        else
            P4OUT = 0x0E;
        break;
    case 1:
        P3OUT = digits[value/10%10];
        if(p4_7_left_led_on) // segment : XXOX
            P4OUT = 0x8D;
        else
            P4OUT = 0x0D;
        break;
    case 2:
        P3OUT = digits[value/100%10];
        if(p4_7_left_led_on) // segment : XOXX
            P4OUT = 0x8B;
        else
            P4OUT = 0x0B;
        break;
    case 3:
        P3OUT = digits[value/1000%10];
        if(p4_7_left_led_on) // segment : OXXX
            P4OUT = 0x87;
        else
            P4OUT = 0x07;
        break;
    }
}

void show_screen_arr(void){
    if (dynamic_segment_cnt > 3)
            dynamic_segment_cnt = 0; // count 순회

    switch (dynamic_segment_cnt)
    {
    case 0:
        P3OUT = screen_arr[0];
        if(p4_7_left_led_on) // segment : XXXO
            P4OUT = 0x8E;
        else
            P4OUT = 0x0E;
        break;
    case 1:
        P3OUT = screen_arr[1];
        if(p4_7_left_led_on) // segment : XXOX
            P4OUT = 0x8D;
        else
            P4OUT = 0x0D;
        break;
    case 2:
        P3OUT = screen_arr[2];
        if(p4_7_left_led_on) // segment : XOXX
            P4OUT = 0x8B;
        else
            P4OUT = 0x0B;
        break;
    case 3:
        P3OUT = screen_arr[3];
        if(p4_7_left_led_on) // segment : OXXX
            P4OUT = 0x87;
        else
            P4OUT = 0x07;
        break;
    }
}

unsigned int scale_transform(int input) {
    if (input < ADC_MIN || input > ADC_MAX) {
        return 1111; // out of range Error
    }

    int quotient = 0;
    int dividend = 10 * (input - ADC_MIN);

    while ((dividend - ADC_DELTA_TEN_TIME) >= 0) {
        dividend -= ADC_DELTA_TEN_TIME;
        quotient++;
    }
    return quotient;
}

void init_ADC_single_mode(void){
    P6SEL |= BIT0; // ADC DIR

    /* ADC12 control register set */
    /* sample hold time : 16 adc clock cycles, ADC12 ON */
    ADC12CTL0 = ADC12SHT02 + ADC12ON;

    ADC12CTL1 = ADC12SHP; // sample hold : pulse mode
    ADC12MCTL0 = ADC12INCH_0; // input channel=A0
    ADC12CTL0 |= ADC12ENC; // ADC12 encoding=enable
}

void init_ADC_repeat_single_mode(void){
    P6SEL |= BIT0; // ADC DIR

    /* ADC12 control register set */
    /* sample hold time : 16 adc clock cycles, ADC12 ON */

    ADC12CTL0 = ADC12SHT02 + ADC12MSC + ADC12ON; //ADC REPEAT SINGLE MODE
    ADC12CTL1 = ADC12SHP + ADC12CONSEQ_2; // sample hold : pulse mode, REPEAT SINGLE MODE
    ADC12MCTL0 = ADC12INCH_0; // input channel=A0
    ADC12CTL0 |= ADC12ENC; // ADC12 encoding=enable

    ADC12CTL0 |= ADC12SC; // REPEAT SINGLE MODE
}


void ADC_single_read(unsigned int* p_data){
    ADC12CTL0 |= ADC12SC; // ADC control register set
    while(!(ADC12IFG & BIT0)); // prevent reading previous data
    *p_data = ADC12MEM0; // data save
}

void ADC_repeat_single_read(unsigned int* p_data){
    *p_data = ADC12MEM0;
}

void enable_interrupt_vector(void){
    __bis_SR_register(GIE);
}

void toggle_led_per_time_ms(unsigned int toggle_interval_ms){
    if(toggle_led_per_time_ms_lock==1){
        // toggle two led per time
        if(led_toggle_cnt > toggle_interval_ms ){
            // toggle leds
            if(led_toggle_state){
                turn_on_led(1);
                turn_off_led(2);
                led_toggle_state=0;
            }else{
                turn_off_led(1);
                turn_on_led(2);
                led_toggle_state=1;
            }
            led_toggle_cnt = 0;
        }
    }
}

void init_led(int led_num){
    switch(led_num){
        case 1:
            // LED1 DIR : P1.1
            P1DIR |= BIT0;
            // LED1 OFF
            P1OUT &= ~BIT0;
            break;
        case 2:
            // LED2 DIR : P4.7
            P4DIR |= BIT7;
            // LED2 OFF
            P4OUT &= ~BIT7; // LED2 OFF
    }
}

void turn_on_led(int led_num){
    switch(led_num){
        case 1:
            P1OUT |= BIT0; // LED1 ON
            break;
        case 2:
            P4OUT |= BIT7; // LED2 ON
            p4_7_left_led_on = 1; // p4.7 led and segment pin duplicate error fix
            break;
    }
}
void turn_off_led(int led_num){
    switch(led_num){
        case 1:
            P1OUT &= ~BIT0; // LED1 OFF
            break;
        case 2:
            P4OUT &= ~BIT7; // LED2 OFF
            p4_7_left_led_on = 0; // p4.7 led and segment pin duplicate error fix
            break;
    }
}
void toggle_led(int led_num){
    switch(led_num){
        case 1:
            P1OUT ^= BIT0; // LED1 TOGGLE
        case 2:
            P4OUT ^= BIT7; // LED2 TOGGLE
    }
}

void init_keypad(void){
    // output
    P2DIR |= (BIT0 | BIT2 | BIT3);
    P2OUT |= (BIT0 | BIT2 | BIT3); // all high

    // input
    P6REN |= (BIT3 | BIT4 | BIT5 | BIT6);
    P6OUT |= (BIT3 | BIT4 | BIT5 | BIT6); // pull up
}

// keypad handler
void keypad_input_polling_checker_anticht_by_while(void){ // 꾸욱 누르는 동안 다른 코드가 작동안함(while 문 안에 갇힘)
    // columns 1
    P2OUT &= ~BIT2;
    P2OUT |= (BIT0 | BIT3);

