sprout88/msp430_project/프로젝트_2번/main.c
    if ((P6IN & BIT3) == 0) // Button 1
    {
        while(((P6IN & BIT3) == 0)){
            keypad_push_handler(1);
        }
        keypad_release_handler(1);
    }
    else if ((P6IN & BIT6) == 0) // Button 4
    {
        keypad_push_handler(4);
        while(((P6IN & BIT6) == 0)){}
        keypad_release_handler(4);
    }
    else if ((P6IN & BIT5) == 0) // Button 7
    {
        keypad_push_handler(7);
        while(((P6IN & BIT5) == 0)){}
        keypad_release_handler(7);
    }
    else if ((P6IN & BIT4) == 0) // Button *
    {
        keypad_push_handler(11);
        while(((P6IN & BIT4) == 0)){}
        keypad_release_handler(11); //11:*
    }

    // columns 2
    P2OUT &= ~BIT0;
    P2OUT |= (BIT2 | BIT3);

    if ((P6IN & BIT3) == 0) // Button 2
    {
        while(((P6IN & BIT3) == 0)){
            keypad_push_handler(2);
        }
        keypad_release_handler(2);
    }
    else if ((P6IN & BIT6) == 0) // Button 5
    {
        keypad_push_handler(5);
        while(((P6IN & BIT6) == 0)){}
        keypad_release_handler(5);
    }
    else if ((P6IN & BIT5) == 0) // Button 8
    {
        keypad_push_handler(8);
        while(((P6IN & BIT5) == 0)){}
        keypad_release_handler(8);
    }
    else if ((P6IN & BIT4) == 0) // Button 0
    {
        keypad_push_handler(0);
        while(((P6IN & BIT4) == 0)){}
        keypad_release_handler(0);
    }

    // columns 3
    P2OUT &= ~BIT3;
    P2OUT |= (BIT0 | BIT2);

    if ((P6IN & BIT3) == 0) // Button 3
    {
        while(((P6IN & BIT3) == 0)){
            keypad_push_handler(3);
        }
        keypad_release_handler(3);
    }
    else if ((P6IN & BIT6) == 0) // Button 6
    {
        keypad_push_handler(6);
        while(((P6IN & BIT6) == 0)){}
        keypad_release_handler(6);
    }
    else if ((P6IN & BIT5) == 0) // Button 9
    {
        keypad_push_handler(9);
        while(((P6IN & BIT5) == 0)){}
        keypad_release_handler(9);
    }
    else if ((P6IN & BIT4) == 0) // Button #
    {
        keypad_push_handler(12);
        while(((P6IN & BIT4) == 0)){}
        keypad_release_handler(12); // 12:sharp

    }
}
void keypad_input_polling_checker_anticht_by_lock(char* p_pushed_lock_arr) {
    // Columns 1
    P2OUT &= ~BIT2;
    P2OUT |= (BIT0 | BIT3);

    if ((P6IN & BIT3) == 0 && p_pushed_lock_arr[1] == 0) { // Button 1
        keypad_push_handler(1);
        p_pushed_lock_arr[1] = 1; // Lock the button
    } else if ((P6IN & BIT3) != 0 && p_pushed_lock_arr[1] == 1) {
        keypad_release_handler(1);
        p_pushed_lock_arr[1] = 0; // Unlock the button
    }

    if ((P6IN & BIT6) == 0 && p_pushed_lock_arr[4] == 0) { // Button 4
        keypad_push_handler(4);
        p_pushed_lock_arr[4] = 1; // Lock the button
    } else if ((P6IN & BIT6) != 0 && p_pushed_lock_arr[4] == 1) {
        keypad_release_handler(4);
        p_pushed_lock_arr[4] = 0; // Unlock the button
    }

    if ((P6IN & BIT5) == 0 && p_pushed_lock_arr[7] == 0) { // Button 7
        keypad_push_handler(7);
        p_pushed_lock_arr[7] = 1; // Lock the button
    } else if ((P6IN & BIT5) != 0 && p_pushed_lock_arr[7] == 1) {
        keypad_release_handler(7);
        p_pushed_lock_arr[7] = 0; // Unlock the button
    }

    if ((P6IN & BIT4) == 0 && p_pushed_lock_arr[11] == 0) { // Button *
        keypad_push_handler(11);
        p_pushed_lock_arr[11] = 1; // Lock the button
    } else if ((P6IN & BIT4) != 0 && p_pushed_lock_arr[11] == 1) {
        keypad_release_handler(11);
        p_pushed_lock_arr[11] = 0; // Unlock the button
    }

    // Columns 2
    P2OUT &= ~BIT0;
    P2OUT |= (BIT2 | BIT3);

    if ((P6IN & BIT3) == 0 && p_pushed_lock_arr[2] == 0) { // Button 2
        keypad_push_handler(2);
        p_pushed_lock_arr[2] = 1; // Lock the button
    } else if ((P6IN & BIT3) != 0 && p_pushed_lock_arr[2] == 1) {
        keypad_release_handler(2);
        p_pushed_lock_arr[2] = 0; // Unlock the button
    }

    if ((P6IN & BIT6) == 0 && p_pushed_lock_arr[5] == 0) { // Button 5
        keypad_push_handler(5);
        p_pushed_lock_arr[5] = 1; // Lock the button
    } else if ((P6IN & BIT6) != 0 && p_pushed_lock_arr[5] == 1) {
        keypad_release_handler(5);
        p_pushed_lock_arr[5] = 0; // Unlock the button
    }

    if ((P6IN & BIT5) == 0 && p_pushed_lock_arr[8] == 0) { // Button 8
        keypad_push_handler(8);
        p_pushed_lock_arr[8] = 1; // Lock the button
    } else if ((P6IN & BIT5) != 0 && p_pushed_lock_arr[8] == 1) {
        keypad_release_handler(8);
        p_pushed_lock_arr[8] = 0; // Unlock the button
    }

    if ((P6IN & BIT4) == 0 && p_pushed_lock_arr[0] == 0) { // Button 0
        keypad_push_handler(0);
        p_pushed_lock_arr[0] = 1; // Lock the button
    } else if ((P6IN & BIT4) != 0 && p_pushed_lock_arr[0] == 1) {
        keypad_release_handler(0);
        p_pushed_lock_arr[0] = 0; // Unlock the button
    }

    // Columns 3
    P2OUT &= ~BIT3;
    P2OUT |= (BIT0 | BIT2);

    if ((P6IN & BIT3) == 0 && p_pushed_lock_arr[3] == 0) { // Button 3
        keypad_push_handler(3);
        p_pushed_lock_arr[3] = 1; // Lock the button
    } else if ((P6IN & BIT3) != 0 && p_pushed_lock_arr[3] == 1) {
        keypad_release_handler(3);
        p_pushed_lock_arr[3] = 0; // Unlock the button
    }

    if ((P6IN & BIT6) == 0 && p_pushed_lock_arr[6] == 0) { // Button 6
        keypad_push_handler(6);
        p_pushed_lock_arr[6] = 1; // Lock the button
    } else if ((P6IN & BIT6) != 0 && p_pushed_lock_arr[6] == 1) {
        keypad_release_handler(6);
        p_pushed_lock_arr[6] = 0; // Unlock the button
    }

    if ((P6IN & BIT5) == 0 && p_pushed_lock_arr[9] == 0) { // Button 9
        keypad_push_handler(9);
        p_pushed_lock_arr[9] = 1; // Lock the button
    } else if ((P6IN & BIT5) != 0 && p_pushed_lock_arr[9] == 1) {
        keypad_release_handler(9);
        p_pushed_lock_arr[9] = 0; // Unlock the button
    }

    if ((P6IN & BIT4) == 0 && p_pushed_lock_arr[12] == 0) { // Button #
        keypad_push_handler(12);
        p_pushed_lock_arr[12] = 1; // Lock the button
    } else if ((P6IN & BIT4) != 0 && p_pushed_lock_arr[12] == 1) {
        keypad_release_handler(12);
        p_pushed_lock_arr[12] = 0; // Unlock the button
    }
}

