sprout88/msp430_project/프로젝트_2번/main.c
// motor functions
void init_motor(void){
    // PWN set
    P2DIR |= (BIT5 | BIT4);
    P2SEL |= (BIT5 | BIT4);
    TA2CCR0 = 1000;
    TA2CCTL2 = OUTMOD_6;
    TA2CCR2 = 0;
    TA2CCTL1 = OUTMOD_6;
    TA2CCR1 = 0;
    TA2CTL = TASSEL_2 + MC_1;
}
void set_motor_spin_pwm(unsigned int* p_clockwise_pwm, unsigned int* p_anti_clockwise_pwn){
    unsigned int clockwise_pwm = *p_clockwise_pwm;
    unsigned int anti_clockwise_pwn = *p_anti_clockwise_pwn;


    /* 모터 pwm 이 overflow 되는 것을 방지 */
    if(clockwise_pwm>0 && clockwise_pwm<=300){
        *p_clockwise_pwm = 300;
    }
    if(clockwise_pwm>1000){
        *p_clockwise_pwm = 1000;
    }

    if(anti_clockwise_pwn>0 && anti_clockwise_pwn<=300){
        *p_clockwise_pwm = 300;
    }
    if(anti_clockwise_pwn>1000){
        *p_clockwise_pwm = 1000;
    }

    TA2CCR2 = clockwise_pwm;
    TA2CCR1 = anti_clockwise_pwn;

}

void set_motor_spin_pwm_single(int* p_total_pwm, unsigned int* p_clockwise_pwm, unsigned int* p_anti_clockwise_pwm){
    unsigned int clockwise_pwm = *p_clockwise_pwm;
    unsigned int anti_clockwise_pwm = *p_anti_clockwise_pwm;

    // p_total_pwm 연산
    if(clockwise_pwm>anti_clockwise_pwm){
        *p_total_pwm = clockwise_pwm - anti_clockwise_pwm;
    }else if(clockwise_pwm<anti_clockwise_pwm){
        *p_total_pwm = clockwise_pwm - anti_clockwise_pwm;
    }else if(clockwise_pwm==anti_clockwise_pwm){
        *p_total_pwm = 0;
    }

    /* 실제 모터 회전 */
    if(*p_total_pwm>0){
        TA2CCR2 = *p_total_pwm;
        TA2CCR1 = 0;
    }else if(*p_total_pwm<0){
        TA2CCR2 = 0;
        TA2CCR1 = -(*p_total_pwm);
    }else if(*p_total_pwm==0){
        TA2CCR2 = 0;
        TA2CCR1 = 0;
    }


}

void motor_speed_controller_7(int dir_signal_recved, unsigned int* p_cnt_7,int* p_motor_signal){ // set_motor_spin_pwm 과 같이 사용해야함
    unsigned int interpolated_pwm = 0;

    if(*p_motor_signal==1) // 모터 가동 신호를 받으면 모터를 작동시킴
    {
        if(motor_cnt_7_lock==0)
            motor_cnt_7_lock=1; // 카운터락 해제, 7초 세기 시작

        if(*p_cnt_7<7000){ // 모터 7초 동안 속력 서서히 증가
            interpolated_pwm = *p_cnt_7/10 + 300; // 선형보간으로 계산, 0sec->300pwm,7000sec->1000pwm
            if(dir_signal_recved)
                g_clockwise_pwm = interpolated_pwm;
            else
                g_anti_clockwise_pwm = interpolated_pwm;
            }else{
                //7초 종료 후에는 최고속 유지
                *p_cnt_7=0; // 7초 카운터 초기화
                motor_cnt_7_lock=0; // 7초 카운터 잠금
                *p_motor_signal = 0; // signal 초기화
            }
    }else if(*p_motor_signal==-1) // 모터 정지 신호를 받으면 모터를 정지시킴
    {
        if(motor_cnt_7_lock==0)
            motor_cnt_7_lock=1; // 7초 세기 시작

        if(*p_cnt_7<7000){ // 7초 동안 속력 서서히 감소
            interpolated_pwm = *p_cnt_7/10 + 300;
            if(dir_signal_recved) // 방향에 따라 다르게 작동
                g_clockwise_pwm = interpolated_pwm;
            else
                g_anti_clockwise_pwm = interpolated_pwm;
        }else{
            // 7초 뒤
            *p_cnt_7=0; // 7초 카운터 초기화
            motor_cnt_7_lock=0; // 7초 카운터 잠금

            /* 두 모터 정지 */
            g_clockwise_pwm = 0;
            g_anti_clockwise_pwm = 0;

            // 상태를 정지로 바꿈.
            *p_motor_signal = 0; // signal 초기화
        }

    }
}
void keypad_push_motor_handler(char* p_keypad_push_lock_arr,unsigned int* p_clockwise_pwm,unsigned int* p_anti_clockwise_pwm){
    
    if(motor_ms_cooldown==0){ // 모터의 속도를 조절 (7초 동안 서서히 증가&감소 하도록)
        switch(p_keypad_push_lock_arr[11]){
        case 1: // * 를 누르면,
            if(*p_clockwise_pwm<1000){
                if(*p_clockwise_pwm<300){
                    *p_clockwise_pwm = 300; // 초기구간 건너뛰기
                }
                (*p_clockwise_pwm)+=100;
            }
            else if(*p_clockwise_pwm>=1000 && *p_anti_clockwise_pwm != 0){ // 1000 보다 커지면 반대쪽 pwm 감소
                *p_clockwise_pwm = 1000;
                (*p_anti_clockwise_pwm)-=100;
                if((*p_anti_clockwise_pwm)==0) // 300까지 감소하면 0으로 점프
                    (*p_anti_clockwise_pwm)=0;
            }
            motor_ms_cooldown = 1000; // 1sec/100pwm, 7sec/300~1000pwm
            break;
        }
        switch(p_keypad_push_lock_arr[12]){
            case 1:
                if(*p_anti_clockwise_pwm<1000){
                    if(*p_anti_clockwise_pwm<300){
                        *p_anti_clockwise_pwm = 300; // 초기구간 건너뛰기
                    }
                    (*p_anti_clockwise_pwm)+=100;
                }
                else if(*p_anti_clockwise_pwm>=1000 && *p_clockwise_pwm != 0){  // 1000 보다 커지면 반대쪽 pwm 감소
                    *p_anti_clockwise_pwm = 1000;
                    (*p_clockwise_pwm)-=100;
                    if((*p_clockwise_pwm)==0) // 300까지 감소하면 0으로 점프
                    (*p_clockwise_pwm)=0;
                }
                motor_ms_cooldown = 1000;
                break;
        }
    }
}

// Timer interrupt service routine
// 1ms 마다 호출됨
#pragma vector=TIMER0_A0_VECTOR
__interrupt void TIMER0_A0_ISR(void)
{
    /* overflow counters */
    // 0~65535 까지 증가하고 0으로 초기화됨
    dynamic_segment_cnt++; // 7 Segment Dynamic 구동 타이머
    led_toggle_cnt++; // 1++ per 1ms, no iterate

    /* iterate counters */
    // 특정값까지 세고 0으로 돌아옴
    smclk_cnt++; // 1++ per 1ms, iterate
    if(smclk_cnt>1000){ // 1초를 셈 (1ms)
        smclk_cnt=0;
    }

    /* lock counters */
    // enable(1) 되었을때만 카운트.
    if(motor_cnt_7_lock==1)
        motor_cnt_7++; // 1++ per 1ms, iterate

    /* cooldowns */
    // 외부에서 cooldown 값으로 변하고, 0으로 바꾸기 위해 count 함
    if(motor_ms_cooldown!=0){
        motor_ms_cooldown--;
    }
}

// right switch interrupt
#pragma vector=PORT2_VECTOR
__interrupt void Port_2(void)
{
    if((P2IN & BIT1) == 0)
    {
        is_right_switch = 1;
        right_switch_interrupt_handler();
    }
    P2IFG &= ~BIT1; // IFG clear (Interrupt END)
}

// left switch interrupt
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void)
{
    if((P1IN & BIT1) == 0)
    {
        is_left_switch = 1;
        left_switch_interrupt_handler();
    }
    P1IFG &= ~BIT1; // IFG clear (Interrupt END)
}
